import { i18next } from 'gm-i18n'
import React from 'react'

class MaxDiscountDemo extends React.Component {
  render() {
    return (
      <div>
        <div>
          <div className='gm-text-16'>{i18next.t('示例1') + ':'}</div>
          <div>
            <p>
              {i18next.t(
                '白菜1元/斤，萝卜2元/斤，客户共下单50斤白菜，50斤萝卜，共150元，使用满150-50的优惠券进行支付，共支付100元。'
              )}
            </p>
            <p>
              {i18next.t(
                '支付之后出现异常，所有萝卜需要退货，共退货50斤萝卜，实际订单产生出库金额只有50斤白菜，共50元。'
              )}
            </p>
            <p>
              {i18next.t(
                '如此时优惠券不进行回退，则会出现50元（商品金额）-50元（优惠券金额）=0元的情况，即客户0元购买了50斤白菜。'
              )}
            </p>
          </div>
        </div>
        <div className='gm-gap-10' />

        <div>
          <div className='gm-text-16'>{i18next.t('示例2') + ':'}</div>
          <div>
            <p>
              {i18next.t(
                '白菜1元/斤，萝卜2元/斤，客户共下单50斤白菜，50斤萝卜，共150元，使用满150-50的优惠券进行支付，共支付100元。'
              )}
            </p>
            <p>
              {i18next.t(
                '支付之后出现异常，所有30斤萝卜需要退货，实际订单产生出库金额只有50斤白菜，和20斤萝卜，共90元，如此时优惠券。'
              )}
            </p>
            <p>
              {i18next.t(
                '不进行回退，则会出现90元（商品金额）-50元（优惠券金额）=40元的情况，即客户40元购买了50斤白菜和20斤萝卜，优惠比例达到 40➗90，优惠折扣接近4折。'
              )}
            </p>
          </div>
        </div>
        <div className='gm-gap-15' />

        <div style={{ fontWeight: '600' }}>
          <p>
            {i18next.t(
              '以上两种情况下，如仍然让用户正常使用优惠券，会出现优惠金额超出预期的情况，使企业遭受损失。'
            )}
          </p>
          <p>
            {i18next.t(
              '因此我们引入了“最大优惠比例概念”，即当订单如果使用优惠券后的金额除以不用优惠券的金额小于这个比例，则视为优惠超出可承受预期，为避免企业遭受损失，在这种情况下，优惠券将回退进入客户账户。'
            )}
          </p>
          <p>
            {i18next.t(
              '如设为80%，即表明这个订单使用优惠券后，表示最多可以给客户打8折，不可低于这个折扣，否则将退还已用优惠券。'
            )}
          </p>
        </div>
      </div>
    )
  }
}

export default MaxDiscountDemo
